In [13]:
import pandas as pd
import numpy as np
import sklearn as sk
import psycopg2
import sqlalchemy
import pandas.io.sql as psql
import seaborn as sns
import matplotlib as plt

%matplotlib inline

In [3]:
# create a connection to the database
# conn = psycopg2.connect("dbname=pitchfork")

OperationalError: FATAL:  database "pitchfork" does not exist

In [4]:
"""Connect to database"""
conn = psycopg2.connect("dbname=pitchfork_db2")

In [5]:
cur = conn.cursor()

In [7]:
query = """SELECT table_name
FROM information_schema.tables
WHERE table_type='BASE TABLE'
AND table_schema='public';"""

In [8]:
cur.execute(query)

In [9]:
cur.fetchall()

[('reviews',),
 ('genres',),
 ('labels',),
 ('years',),
 ('content',),
 ('artists',)]

In [14]:
"""Create artists dataframe"""
df_artists = psql.read_sql("SELECT * FROM artists;", conn)
df_artists.head()

   reviewid          artist  id
0     22703  massive attack   1
1     22721        krallice   2
2     22659    uranium club   3
3     22661         kleenex   4
4     22661         liliput   5

In [15]:
"""Create content dataframe"""
df_content = psql.read_sql("SELECT * FROM content;", conn)
df_content.head()

   reviewid                                            content
0     22703  “Trip-hop” eventually became a ’90s punchline,...
1     22721  Eight years, five albums, and two EPs in, the ...
2     22659  Minneapolis’ Uranium Club seem to revel in bei...
3     22661  Kleenex began with a crash. It transpired one ...
4     22725  It is impossible to consider a given release b...

In [16]:
"""Create genres dataframe"""
df_genres = psql.read_sql("SELECT * FROM genres;", conn)
df_genres.head()

   reviewid       genre
0     22703  electronic
1     22721       metal
2     22659        rock
3     22661        rock
4     22725  electronic

In [17]:
"""Create labels dataframe"""
df_labels = psql.read_sql("SELECT * FROM labels;", conn)
df_labels.head()

   reviewid               label
0     22703              virgin
1     22721           hathenter
2     22659        static shock
3     22659  fashionable idiots
4     22661     kill rock stars

In [18]:
"""Create reviews dataframe"""
df_reviews = psql.read_sql("SELECT * FROM reviews;", conn)
df_reviews.head()

,reviewid,title,artist,url,score,best_new_music,author,author_type,pub_date,pub_weekday,pub_day,pub_month,pub_year
0,22703,mezzanine,massive attack,http://pitchfork.com/reviews/albums/22703-mezz...,9.3,0,nate patrin,contributor,2017-01-08,6,8,1,2017
1,22721,prelapsarian,krallice,http://pitchfork.com/reviews/albums/22721-prel...,7.9,0,zoe camp,contributor,2017-01-07,5,7,1,2017
2,22659,all of them naturals,uranium club,http://pitchfork.com/reviews/albums/22659-all-...,7.3,0,david glickman,contributor,2017-01-07,5,7,1,2017
3,22661,first songs,"kleenex, liliput",http://pitchfork.com/reviews/albums/22661-firs...,9.0,1,jenn pelly,associate reviews editor,2017-01-06,4,6,1,2017
4,22725,new start,taso,http://pitchfork.com/reviews/albums/22725-new-...,8.1,0,kevin lozano,tracks coordinator,2017-01-06,4,6,1,2017

In [19]:
"""Create years dataframe"""
df_years = psql.read_sql("SELECT * FROM years", conn)
df_years.head()

   reviewid    year
0     22703  1998.0
1     22721  2016.0
2     22659  2016.0
3     22661  2016.0
4     22725  2016.0